Johansty/ProyectoFinal_K32L2B3/K32L2B31A_Project/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INT2_ACCEL_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INT2_ACCEL_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INT2_ACCEL_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INT2_ACCEL_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INT2_ACCEL_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INT2_ACCEL_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTC5 (number 54), J1[15]/INT1_ACCEL/LCD_P25
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INT1_ACCEL_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INT1_ACCEL_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INT1_ACCEL_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INT1_ACCEL_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INT1_ACCEL_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INT1_ACCEL_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL_I2CPins(void);

/*! @name PORTA19 (number 33), XTAL_32KHZ
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_XTAL_32KHZ_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_XTAL_32KHZ_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_XTAL_32KHZ_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTA18 (number 32), EXTAL_32KHZ
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EXTAL_32KHZ_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_EXTAL_32KHZ_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_EXTAL_32KHZ_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

/*! @name PORTE22 (number 11), J4[5]/DIFF_ADC1_DP
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADCPINS_LUM_MICRO_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADCPINS_LUM_MICRO_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_LUM_MICRO_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTB2 (number 37), J4[6]/A2/LCD_P2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADCPINS_LUM_EXT_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADCPINS_LUM_EXT_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITADCPINS_LUM_EXT_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADCPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSTH31_I2CPins(void);

/*! @name PORTA12 (number 28), RELE_IN1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITRELESPINS_RELE_IN1_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITRELESPINS_RELE_IN1_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITRELESPINS_RELE_IN1_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITRELESPINS_RELE_IN1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITRELESPINS_RELE_IN1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITRELESPINS_RELE_IN1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTA13 (number 29), RELE_IN2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITRELESPINS_RELE_IN2_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITRELESPINS_RELE_IN2_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITRELESPINS_RELE_IN2_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITRELESPINS_RELE_IN2_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITRELESPINS_RELE_IN2_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITRELESPINS_RELE_IN2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitRELESPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
